In [2]:
import pandas as pd
import pickle

In [3]:
kbo = pd.read_pickle("./kbo_detail.pkl")

In [4]:
kbo[['team','선수명']]

       team   선수명
0    한화 이글스   강재민
1    한화 이글스   권광민
2    한화 이글스   권동욱
3    한화 이글스    권현
4    한화 이글스   김강민
..      ...   ...
839   KT 위즈   한민우
840   KT 위즈   한차현
841   KT 위즈   홍현빈
842   KT 위즈   황의준
843   KT 위즈   황재균

[844 rows x 2 columns]

In [5]:
kbo['신장' ] = kbo['신장/체중'].apply(lambda x : int(x.split("/")[0].replace("cm", "")))

In [6]:
kbo['체중' ] = kbo['신장/체중'].apply(lambda x : int(x.split("/")[1].replace("kg", "")))

In [7]:
kbo['BMI']  = kbo['체중' ] / (kbo['신장']/100)**2

In [8]:
kbo.sort_values(by='BMI', ascending=False).head()

,선수명,등번호,생년월일,포지션,신장/체중,경력,입단 계약금,연봉,지명순위,입단년도,team,신장,체중,BMI
10,김민우,No.53,1995년 07월 25일,투수(우투우타),186cm/123kg,사파초-마산중-용마고,20000만원,16700만원,15 한화 2차 1라운드 1순위,15한화,한화 이글스,186,123,35.553243
356,김범석,No.55,2004년 05월 21일,포수(우투우타),178cm/110kg,김해삼성초-경남중-경남고,25000만원,3300만원,23 LG 1라운드 7순위,23LG,LG 트윈스,178,110,34.717839
30,박성웅,No.63,1999년 08월 20일,투수(좌투좌타),178cm/109kg,광주서석초-충장중-광주제일고,10000만원,3300만원,18 한화 2차 2라운드 14순위,18한화,한화 이글스,178,109,34.402222
57,이성원,No.98,1999년 11월 02일,내야수(우투우타),185cm/115kg,수원신곡초-매향중-장안고,6000만원,3000만원,18 한화 2차 6라운드 54순위,,한화 이글스,185,115,33.601169
509,김기연,No.45,1997년 09월 07일,포수(우투우타),178cm/106kg,광주수창초-진흥중-진흥고-LG,7000만원,4000만원,16 LG 2차 4라운드 34순위,17LG,두산 베어스,178,106,33.455372

In [9]:
kbo.drop(['신장/체중'], axis=1, inplace=True)

In [10]:
kbo2 = kbo.groupby('team')[['신장', '체중']].mean()

In [11]:
kbo2.loc[ 'KIA 타이거즈' , :  ]

신장    182.773810
체중     88.666667
Name: KIA 타이거즈, dtype: float64

In [12]:
kbo2.loc[ 'KIA 타이거즈' , :  ]

신장    182.773810
체중     88.666667
Name: KIA 타이거즈, dtype: float64

In [13]:
kbo2.loc[ 'KIA 타이거즈':'SSG 랜더스' , '신장'  ]

team
KIA 타이거즈    182.773810
KT 위즈       182.103448
LG 트윈스      182.986486
NC 다이노스     183.146067
SSG 랜더스     181.975309
Name: 신장, dtype: float64

In [14]:
kbo2.iloc[2:4, 0]

team
LG 트윈스     182.986486
NC 다이노스    183.146067
Name: 신장, dtype: float64

In [15]:
kbo.groupby('team')[['신장', '체중']].agg(['mean', 'median', 'min', 'max', 'var', 'std' ])

                  신장                                               체중         \
                mean median  min  max        var       std       mean median
team
KIA 타이거즈  182.773810  183.0  165  195  23.044607  4.800480  88.666667   87.0
KT 위즈     182.103448  183.0  170  193  23.024058  4.798339  85.390805   85.0
LG 트윈스    182.986486  183.0  171  194  26.177897  5.116434  87.270270   85.5
NC 다이노스   183.146067  183.0  171  196  23.194331  4.816049  87.089888   86.0
SSG 랜더스   181.975309  182.0  165  193  25.324383  5.032334  86.148148   88.0
고양 히어로즈   181.739130  182.0  173  188  13.928854  3.732138  84.347826   83.0
두산 베어스    183.166667  183.0  175  195  22.236948  4.715607  87.261905   88.5
롯데 자이언츠   183.282353  182.0  172  197  25.300280  5.029938  88.988235   88.0
삼성 라이온즈   182.482353  183.0  163  198  30.752661  5.545508  87.376471   87.0
키움 히어로즈   181.016949  181.0  169  194  26.534191  5.151135  87.288136   88.0
한화 이글스    182.473118  183.0  173  192  18.578074  4.310229  88.817204   89.0


         min  max         var        std
team
KIA 타이거즈  68  108   77.502008   8.803522
KT 위즈     68  107   68.357124   8.267837
LG 트윈스    67  110   95.734173   9.784384
NC 다이노스   69  115   61.969101   7.872046
SSG 랜더스   65  108   76.027778   8.719391
고양 히어로즈   73  105   79.873518   8.937199
두산 베어스    68  106   81.834194   9.046225
롯데 자이언츠   72  118   79.202241   8.899564
삼성 라이온즈   62  113   91.761345   9.579214
키움 히어로즈   73  109   68.277615   8.263027
한화 이글스    65  123  103.498831  10.173438

In [16]:
kbo['경력'].apply(lambda x : x.split('-')[0]).value_counts().reset_index().rename(columns={'count' : '명'})

               경력   명
0           부산수영초  19
1             가동초  14
2             양정초  14
3             본리초  13
4           광주대성초  13
..            ...  ..
345   거제제산초(거제리틀)   1
346           영천초   1
347    양남초(하남시리틀)   1
348    신기초(금천구리틀)   1
349    홍연초(마포구리틀)   1

[350 rows x 2 columns]

In [17]:
kbo[kbo['경력'].str.find("부산수영초") > -1]['team'].value_counts()

team
롯데 자이언츠     5
한화 이글스      3
SSG 랜더스     3
LG 트윈스      3
KIA 타이거즈    1
NC 다이노스     1
키움 히어로즈     1
두산 베어스      1
삼성 라이온즈     1
Name: count, dtype: int64

In [18]:
kbo['생년월일'][0]

' 1997년 04월 03일'

In [19]:
from datetime import date, datetime
kbo['생년월일'] = kbo['생년월일'].apply(lambda x : datetime.strptime(x.replace(" ", ""), "%Y년%m월%d일"))

In [20]:
(datetime.now() - kbo['생년월일'][0])

Timedelta('10464 days 14:25:59.893788')

In [21]:
kbo['생년월일'][0].year

1997

In [22]:
# 현재 야구선수들은 태어나서 몇일 살았나?
# 나이

In [23]:
kbo['생년월일'].apply(lambda x : (datetime.now() - x).days)

0      10464
1      10211
2       9088
3       7581
4      15780
       ...
839     9710
840     9858
841    10316
842     8635
843    14001
Name: 생년월일, Length: 844, dtype: int64

In [24]:
kbo.sort_values(by=['신장'], ascending=False).groupby(['team']).first()

,선수명,등번호,생년월일,포지션,경력,입단 계약금,연봉,지명순위,입단년도,신장,체중,BMI
team,,,,,,,,,,,,
KIA 타이거즈,홍원빈,No.021,2000-10-16,투수(우투우타),안말초-강남중-덕수고,13000만원,3000만원,19 KIA 2차 1라운드 10순위,19KIA,195,101,26.561473
KT 위즈,이준명,No.101,2002-12-18,투수(우투우타),정목초(강서구리틀)-덕수중-성남고-동의대(얼리 드래프트),3000만원,3000만원,23 KT 10라운드 100순위,,193,100,26.846358
LG 트윈스,허용주,No.111,2003-06-05,투수(우투우타),사파초-마산동중-용마고,5000만원,3000만원,23 LG 7라운드 67순위,,194,88,23.381868
NC 다이노스,하트,No.30,1992-11-23,투수(좌투좌타),미국 Indiana(대),200000달러,500000달러,24 NC 자유선발,24NC,196,90,23.427738
SSG 랜더스,서상준,No.61,2000-01-14,투수(우투좌타),동일중앙초-야로중-영문고,4000만원,3200만원,19 SK 2차 7라운드 66순위,23SSG,193,108,28.994067
고양 히어로즈,조성훈,No.100,1999-03-22,투수(우투우타),응봉초(성동구리틀)-건대부중-청원고-SK-상무-SK-SSG,15000만원,3100만원,18 SK 2차 1라운드 5순위,18SK,188,85,24.049344
두산 베어스,이상연,No.103,2001-08-10,투수(우투우타),해원초(수영구리틀)-대천중-부산고,4000만원,3000만원,21 두산 2차 6라운드 60순위,,195,103,27.087442
롯데 자이언츠,윤성빈,No.103,1999-02-26,투수(우투우타),동일중앙초-경남중-부산고,45000만원,3100만원,17 롯데 1차,17롯데,197,90,23.190497
삼성 라이온즈,레예스,No.43,1996-11-02,투수(우투우타),도미니카 Melida Altagracia Baez(고),100000달러,500000달러,24 삼성 자유선발,24삼성,198,113,28.823589
키움 히어로즈,김동규,No.43,2004-07-09,투수(우투우타),서울청구초-영남중-성남고-LG,13000만원,3100만원,23 LG 2라운드 17순위,23LG,194,100,26.570305
한화 이글스,이태양,No.46,1990-07-03,투수(우투좌타),여수서초-여수중-효천고-한화-SK-SSG,7000만원,50000만원,10 한화 5라운드 36순위,10한화,192,97,26.312934

In [25]:
kbo

,선수명,등번호,생년월일,포지션,경력,입단 계약금,연봉,지명순위,입단년도,team,신장,체중,BMI
0,강재민,No.,1997-04-03,투수(우언우타),양덕초-마산중-용마고-단국대,8000만원,14500만원,20 한화 2차 4라운드 38순위,20한화,한화 이글스,180,89,27.469136
1,권광민,No.17,1997-12-12,외야수(좌투좌타),서울청구초-홍은중-장충고,,3300만원,22 한화 2차 5라운드 41순위,16시카고컵스,한화 이글스,189,102,28.554632
2,권동욱,No.02,2001-01-08,외야수(우투우타),가동초-휘문중-배명고-동국대,,3000만원,24 한화 육성선수,,한화 이글스,173,85,28.400548
3,권현,No.111,2005-02-23,외야수(우투우타),사당초-언북중-장충고,3000만원,3000만원,24 한화 10라운드 91순위,,한화 이글스,182,88,26.566840
4,김강민,No.9,1982-09-13,외야수(우투우타),본리초-대구중-경북고-SK-SSG,11000만원,11000만원,01 SK 2차 2라운드 18순위,01SK,한화 이글스,182,87,26.264944
...,...,...,...,...,...,...,...,...,...,...,...,...,...
839,한민우,No.96,1999-04-27,투수(좌투좌타),동일중앙초-경남중-경남고,1000만원,3000만원,23 KT 육성선수,,KT 위즈,177,82,26.173833
840,한차현,No.59,1998-11-30,투수(우투우타),사능초(남양주리틀)-청원중-포항제철고-성균관대,10000만원,3100만원,21 KT 2차 2라운드 15순위,21KT,KT 위즈,180,80,24.691358
841,홍현빈,No.31,1997-08-29,외야수(우투좌타),수원신곡초-매송중-유신고-KT-상무,9000만원,4500만원,17 KT 2차 3라운드 21순위,17KT,KT 위즈,174,70,23.120624
842,황의준,No.103,2002-04-06,외야수(우투좌타),칠성초-경복중-경북고-수성대,4000만원,3000만원,23 KT 8라운드 80순위,,KT 위즈,185,95,27.757487
843,황재균,No.10,1987-07-28,내야수(우투우타),사당초-서울이수중-경기고-현대-히어로즈-롯데-샌프란시스코,6000만원,100000만원,06 현대 2차 3라운드 24순위,06현대,KT 위즈,183,96,28.666129

In [28]:
import requests

In [29]:
url = "https://www.kebhana.com/cms/rate/wpfxd651_01i_01.do"

In [30]:
payload = {"ajax":"true",
"pbldDvCd":"0",
"inqStrDt":"20251126",
"inqKindCd":"1",
"requestTarget":"searchContentDiv"}

In [31]:
exchange = pd.read_html(requests.post(url, data=payload).text)[0]

/tmp/ipykernel_58613/3789694309.py:1: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  exchange = pd.read_html(requests.post(url, data=payload).text)[0]

In [32]:
for x in exchange.columns:
  print("_".join(sorted(list(set(x)))))

통화
사실 때_현찰_환율
Spread_사실 때_현찰
파실 때_현찰_환율
Spread_파실 때_현찰
보낼 때_송금
받을 때_송금
외화 수표 파실때
매매 기준율
환가 료율
미화 환산율

In [33]:
exchange.columns = ["_".join(sorted(list(set(x)))) for x in exchange.columns]

In [34]:
master = {x[0] : x[1] for x in exchange['통화'].str.split().values}

In [35]:
# get_exchange
# 날짜, 나라명

In [37]:
def get_exchange( date_, country='미국'):
  """
  date_ : 환율 날짜(YYYYMMDD)
  country : 국가
  return : 환율
  """
  url = "https://www.kebhana.com/cms/rate/wpfxd651_01i_01.do"
  payload = {"ajax":"true",
            "pbldDvCd":"0",
            "inqStrDt":"20251126",
            "inqKindCd":"1",
            "requestTarget":"searchContentDiv"}
  exchange = pd.read_html(requests.post(url, data=payload).text)[0]
  exchange.columns = ["_".join(sorted(list(set(x)))) for x in exchange.columns]
  master = {x[0] : x[1] for x in exchange['통화'].str.split().values}
  return float(exchange[exchange.통화.str.find(country) > -1]['사실 때_현찰_환율'].values[0])

In [38]:
get_exchange("20251126", '일본')

/tmp/ipykernel_58613/675833430.py:13: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  exchange = pd.read_html(requests.post(url, data=payload).text)[0]

955.35